<script lang="ts" setup>
// 声明一个异步的函数
// 定义响应式变量 LeaderItem
const Introduction = ref()
import {
    articleInfoService, articleTypeListService
} from "@/api/article.js";
import {ref, reactive} from "vue";
// 定义 LeaderInfo 异步方法
const articleInfo = async () => {
    try {
        let result = await articleTypeListService(101);
        // 假设 carouselItems 是一个响应式变量，例如 Vue 中的 ref
        Introduction.value = result.data.rows;
        console.log(Introduction.value)
    } catch (error) {
        console.error("Error fetching data: ", error);
    }
}
articleInfo();
</script>

<template>
    <div v-for="item in Introduction" :key="item.id">
        <el-tag type="primary" effect="dark"> {{ item.articleTitle }}</el-tag>
        <div class="list">
            <li>
                <div v-html="item.articleContent"></div>
            </li>
        </div>
    </div>

    <!--  <h1>-->
    <!--    一、简介-->
    <!--  </h1>-->
    <!--  <p>-->
    <!--    计算机工程系是学院的工科主干系之一，采用与福州大学计算机与大数据学院共建共办的办学模式。现设有计算机科学与技术(含专升本)、软件工程(含专升本)、数字媒体技术和数据科学与大数据技术四个本科专业，以及与经济管理系合办的互联网金融与大数据技术综合实验班，其中，计算机科学与技术专业、软件工程专业分别于2019年和2022年获批省级一流本科专业，软件工程专业2016年获批省级服务产业特色专业，全系目前拥有在校本科生1792名。近年来本系深入贯彻全国教育大会精神，围绕应用型人才培养的办学定位，坚持培养科学精神与人文素养兼备的“创新、创意、创业”型IT人才，本着专业间资源共享、优势互补、系统集成、协同发展的原则，以计算机科学与技术专业为核心，辐射带动软件工程、数据科学与大数据技术、数字媒体技术专业，以服务岗位需求和提高职业能力为导向、项目驱动为手段、能力培养为关键、全面发展为目标，采取“三年理论学习+一年综合实践”的人才培养方案，构建了“理论学习—课程实践—项目实训—企业实习”的阶梯式课程体系，形成服务区域经济发展、产教融合校企合作、行业认可特色鲜明的“计算机类”应用型人才培养专业群。对应于产业和企业需要，专业群内各专业培养目标互补，应用方向鲜明，办学以来取得了一系列显著成果，获得福建省高等教育教学成果奖一等奖1项、二等奖2项。培养的毕业生以厚实的理论基础、过硬的专业技能、踏实的工作作风和良好的综合素质，受到企事业单位的普遍欢迎，就业质量、就业层次、自主创业人数、考取国内外知名高校研究生人数均呈现逐年上升的趋势，2022届一毕业生以考研总成绩专业排名第一被福州大学录取，2021届一专升本毕业生考取复旦大学研究生，办学质量得到社会和企业的高度认可。2019年计算机工程系荣获中华人民共和国教育部、人力资源社会保障部联合授予的<span>“全国教育系统先进集体”</span>称号，计算机系学生第一党支部荣获<span>“全国党建工作样板支部”</span>称号。-->
    <!--  </p>-->

    <!--  <h1 style="color: red">-->
    <!--    二、学科建设：-->
    <!--  </h1>-->
    <!--  <p>推进本科教学工程, 深化教育教学改革，积极开展专业学科建设，获得的省级以上学科建设立项有：</p>-->
    <!--  <div class="item">-->
    <!--    <span>（1）2022年软件工程专业获批“省级一流本科专业”</span><br>-->
    <!--    <span>（2）2021年度福建省社会科学基金项目：容错机制对福建省企业创新的影响研究</span><br>-->
    <!--    <span>（3）2021年度教育部协同育人项目：基于 TF 框架的课程教学</span><br>-->
    <!--    <span>（4）2021年获批省级线下一流本科课程：计算机网络</span><br>-->
    <!--    <span>（5）2020年省级“应用型高校‘新工科’计算机类人才培养模式探索与实践”项目</span><br>-->
    <!--    <span>（6）2020年福建省教育教改研究项目“基于 OBE 理念的网络工程创新创业人才培养模式的探索与研究”</span><br>-->
    <!--    <span>（7）2020年获批省级线上线下一流本科课程：Java程序高级开发</span><br>-->
    <!--    <span>（8）2020年获批省级线下一流本科课程：软件工程与UML</span><br>-->
    <!--    <span>（9）2019年计算机科学与技术专业获批“省级一流本科专业”,并入选教育部首批一流本科专业“双万计划”</span><br>-->
    <!--    <span>（10）2019年获批省级“大数据技术与网络安全虚拟仿真实验中心”</span><br>-->
    <!--    <span>（11）2018年获批省级本科教学团队“对接产业链、服务专业群的应用型大数据教学团队”</span><br>-->
    <!--    <span>（12）2018年获批福建省重大教育教改研究项目“大数据时代‘新工科’跨界人才培养模式研究与实践”</span><br>-->
    <!--    <span>（13）2018年获批福建省教育教改研究项目“‘互联网+’背景下以应用型人才培养为导向的计算机基础课程教学改革”</span><br>-->
    <!--    <span>（14）2017年获批福建省高校应用型学科“计算机科学与技术”</span><br>-->
    <!--    <span>（15）2016年获批福建省高校服务产业特色专业“软件工程”</span><br>-->
    <!--    <span>（16）2016年获批省级实验教学示范中心“数字媒体技术实验教学示范中心” </span><br>-->
    <!--    <span>（17）2016年获批福建省本科高校应用型人才培养专业群试点“计算机类专业群”</span><br>-->
    <!--    <span>（18）2015年获批福建省教育教改研究项目“数字媒体专业产学研应用技术创新性人才培养模式研究”</span><br>-->
    <!--    <span>（19）2013年获批省级实验教学示范中心“计算机工程实验教学示范中心”</span><br>-->
    <!--    <span>（20）2012年获批福建省本科高校专业综合改革试点“计算机科学与技术专业”</span><br>-->
    <!--    <span>（21）2011年获批福建省特色专业“计算机科学与技术专业”</span><br>-->
    <!--    <span>（22）2010年获批福建省人才培养模式创新实验区“‘创意、创新、创业’型IT人才培养模式创新实验区”</span><br>-->
    <!--  </div>-->

    <!--  <h1 style="color: red">-->
    <!--    三、师资力量：-->
    <!--  </h1>-->
    <!--  <p>本系共享福州大学计算机与大数据学院雄厚的师资力量，并通过特聘兼职教授、兼职工程师制度引进校外专家学者和企业工程师，构建了一支由38名校内专职教师、5名兼职教授以及20多名企业工程师构成的师资队伍。校内专职教师中，教授3名，副教授15名21%具有博士学位或正在攻读博士学位，9%具有海外学习工作经历，45%为“双师双能型”教师结构合理，既有博士生导师、硕士生导师,又有一批朝气蓬勃的青年教师。特聘兼职教授作为本系教学指导委员会的重要成员，为学科建设、人才培养出谋划策，同时参与前沿讲座、教学改革立项建设、指导学生科技创新等活动。实践经验丰富的企业工程师协助指导课程实训、技能实践、毕业实习、毕业设计和学生创新创业活动。</p>-->

    <!--  <h1 style="color: red">-->
    <!--    四、办学特色：-->
    <!--  </h1>-->
    <!--  <p>为了更好地对接地方产业需求，培养应用型人才，本系以《普通高等学校本科专业类教学质量国家标准》（新版）、《工程教育专业认证标准》等作为指导思想，坚持“用以致学，以用驱动”的建设目标，贯彻产教融合的教书育人模式，从人才培养、课程重构、师资优化、平台建设、校企合作、国际交流、素质教育七个方面着力构建了“七位一体”的办学特色，努力建设具有工科特色和区域影响力的高水平、高质量、有特色、有影响的应用型专业。</p>-->
    <!--  <div class="item">-->
    <!--    <span>（1）在<strong>创新人才培养</strong>方面，扩大学生的学习自主权，实施以学生为中心的参与式教学，逐步扩大学生自主选择专业方向和选修课程的权利，通过应用型专业群建设，打破专业壁垒，允许学生进行跨专业、跨学科选修或根据企业开出的订单式培养进行课程定制，满足学生个性化教育的需求。</span><br>-->
    <!--    <span>（2）在<strong>重构课程体系</strong>方面，坚持向应用型转变，按照对应产业链和企业人才需求开设“数据科学与大数据技术”、“网络技术及应用”、“移动互联网应用开发”、“软件项目开发”、“三维动漫和交互式媒体制作”五个突出实践能力培养的应用方向，并引入行业企业的一线需要作为毕业设计选题来源。</span><br>-->
    <!--    <span>（3）在<strong>优化师资队伍</strong>方面，构建一支“名师教授为专业负责人，企业工程师为生力军，学校教师为主力军”教学能力、专业实践能力兼备的“双师双能型”教师队伍，可根据学生的兴趣和未来的发展，为学生的创新活动和创业活动提供技术指导和项目支持。在师资交流方面，选派骨干教师到美国、澳大利亚知名高校访学交流。</span><br>-->
    <!--    <span>（4）在<strong>建设实验平台</strong>方面，依托省级计算机工程实验教学示范中心、省级大数据技术与网络安全虚拟仿真实验中心、省级数字媒体技术实验教学示范中心，通过对基础实验平台、专业实验平台、创新创业开放实验平台和校外实习基地的建设，构建提升专业技能、拓展综合素质、参与项目研发的综合实验教学平台。</span><br>-->
    <!--    <span>（5）在<strong>创新实验教学</strong>方法方面，采用面向企业的项目教学法、面向兴趣的科研教学法、面向竞争的激励教学法、面向就业的证书教学法等，激发学生的学习兴趣和探索精神。</span><br>-->
    <!--    <span>（6）在<strong>深化校企合作</strong>方面，通过与企业共建实验室和实习基地，引入企业真实项目和企业职业资格认证，实现企业工程师进驻实验室，带领学生按照规范的开发过程进行项目研发和技术创新，实现专业链与产业链、课程内容与职业标准、教学过程与生产过程对接。</span><br>-->
    <!--    <span>（7）在<strong>推进素质教育</strong>方面，定期开展关于学科前沿、职业生涯规划、专题技术、创业励志等方面的讲座成立软件开发工作室、信息安全俱乐部、新媒体工作室、ICT俱乐部、大数据俱乐部、编程俱乐部、动漫俱乐部、人工智能俱乐部等技术学习俱乐部组织学生参与各类专业性、创新性、创意性、创业性竞赛组织学生跟随开展科技创新活动，申报国家级、省级大学生创新性实验项目。通过以上举措，进一步提升学生的专业技能、创新意识、创意思维、创业能力以及团队协同实战精神，并丰富学生的课余生活。</span><br>-->
    <!--  </div>-->

    <!--  <h1 style="color: red">-->
    <!--    五、科研成果：-->
    <!--  </h1>-->
    <!--  <div class="item">-->
    <!--    <span>（1）近三年来，本系教师获批省教育厅中青年教师教育科研项目15项，在研的“本科教学质量与教学改革工程”项目 17项获福建省科学技术奖一等奖1项，二等奖1项发表学术论文300余篇发表教研论文40余篇申请专利60多项。</span><br>-->
    <!--    <span>（2）近三年本系学生共获批国家级大学生创新创业训练项目4项，省级大学生创新创业训练项目16项，发表论文21篇。</span><br>-->
    <!--  </div>-->

    <!--  <h1 style="color: red">-->
    <!--    六、实验室建设：-->
    <!--  </h1>-->
    <!--  <p>本系通过对基础实验平台、专业实验平台、创新创业开放实验平台和校外实习基地四个方面的建设，构建了提升专业技能、拓展综合素质、参与项目研发的2个省级实验教学示范中心和1个省级虚拟仿真实验中心，充分满足学生实习实践教学需求。</p>-->
    <!--  <div class="item">-->
    <!--    <span>（1）基础实验平台，包括：计算机应用实验室、模拟电路实验室、数字电路实验室、组成与接口实验室、单片机实验室等。</span><br>-->
    <!--    <span>（2）专业实验平台，包括：网络工程实验室、嵌入式与EDA实验室、软件开发实验室、工程训练实验室、大数据实验室、数字媒体实验室、VR实验室。</span><br>-->
    <!--    <span>（3）创新创业开放实验平台，包括：电子创新实验室、软件创新实验室、创业活动室、科技创新活动室、新媒体工作室等。</span><br>-->
    <!--    <span>（4）与省内外知名企业共建的校外实习基地，包括：锐捷网络、福富软件、北卡科技、华三通信、德源信息、中信网安等32家企业，与两家企业达成校企联建。</span><br>-->
    <!--    <span>（5）依托省级大数据技术与网络安全虚拟仿真实验中心，通过虚拟仿真平台可以同时虚拟出300台高性能服务器，基于云计算虚拟化及大数据主流框架搭建高性能教学平台和集群开发环境,将虚拟实验教学融入现有教学体系，以共享优质实验教学资源为核心，推动实验室建设。</span><br>-->
    <!--    <span>（6）依托省级数字媒体实验中心，企业工程师携带项目常驻数字媒体实验室，将企业真实项目用于学生的实习与毕业设计。学生参与制作的动画片《勇敢者日记——迪小龙》第一、二季共52集在东南卫视、青海卫视、厦门卫视等150多家电视媒体上播出，取得了较大的社会反响。近年参与制作的项目中，包含公益广告片《城市道路交通管理行动》、现实题材动画片《习近平寿宁县下党乡》、《赤溪村扶贫》等。</span><br>-->
    <!--  </div>-->

    <!--  <h1 style="color: red">-->
    <!--    七、所获荣誉：-->
    <!--  </h1>-->
    <!--  <div class="item">-->
    <!--    <span>（1）教师获得省级教学成果奖一等奖1项、二等奖2项</span><br>-->
    <!--    <span>（2）院级教学成果奖特等奖1项、一等奖1项省级青年教师教学竞赛三等奖1项，省级“优秀教务工作者”称号1项。</span><br>-->
    <!--    <span>（3）学生参加学科竞赛成绩优异，包括Imagine Cup微软“创新杯”全球学生科技大赛二等奖、中国“互联网+”大学生创新创业大赛银奖、蓝桥杯全国软件和信息技术专业人才大赛金奖、中国高校计算机大赛-网络技术挑战赛国家级二等奖、天梯赛国家级三等奖、“2021RoboCom”机器人开发者大赛国家级二等奖等国家级奖项。</span><br>-->
    <!--    <span>（4）2019年我系荣获中华人民共和国教育部、人力资源社会保障部联合授予的“全国教育系统先进集体”称号，学生第一党支部荣获“全国党建工作样板支部”称号。</span><br>-->
    <!--    <span>（5）学生还在党团活动、文体活动中获得众多荣誉，连续多年荣获“五四红旗团委”、“五四红旗团支部”、“先进班级”等团体荣誉称号。</span><br>-->
    <!--  </div>-->
</template>


<style lang="scss" scoped>
ol,
ul,
li {
    list-style-type: none;
    margin-top: 40px;
}

.el-tag {
    padding: 20px 20px;
    font-size: 20px;
    background-color: #015ca1;
    border: 1px solid #015ca1;
    border-radius: 0%;
}

/* 每段首行缩进2个字符 */
//p {
//  text-indent: 2em;
//  font-size: 1rem;
//  color: #323232;
//  line-height: 2.375rem;
//  // font-family: 宋体, simsun;
//
//
//  span {
//    font-weight: 700;
//    color: #323232;
//    // font-family: 宋体, simsun;
//  }
//}
//
//.item {
//  span {
//    display:inline-block;
//    text-indent: 2em;
//    line-height: 1.7rem;
//    color: #323232;
//    // font-family: 宋体, simsun;
//  }
//}
</style>